python-blockMesh-code/NACAFoil-OpenFOAM-master/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-7;
        relTol           0.1;
        nSweeps          1;
    }

    "(U|k|omega)Final"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-7;
        relTol           0;
        nSweeps          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-2;
        U               1e-2;
    }
}

PIMPLE
{
    correctPhi          no;
    nOuterCorrectors    20;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        U
        {
            tolerance 1e-3;
            relTol 0;
        }
        p
        {
            tolerance 1e-2;
            relTol 0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p               0.7;
    }
    equations
    {
        "(U|k|omega)"   0.8;
        "(U|k|omega)Final" 1.0;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
